
## Plan Result




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_connection_string
  * module.opal_redis.azurerm_private_endpoint.this[0]
  * module.opal_redis.azurerm_redis_cache.redis
  * module.opal_redis.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg"
      + name                    = "redis-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.opal_redis.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "opal-stg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "opal-cache-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
      + tags                     = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-frontend.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "opal-stg"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.opal_redis.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "opal-stg"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "opal-cache-stg"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-frontend.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.opal_redis.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "opal-cache-stg"
      + tags     = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-frontend.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Vars":{}} -->